Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1180/periph/PERI_IOMUXC.h
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_32 = 310U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_33 = 311U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_34 = 312U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_35 = 313U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_36 = 314U,  /**< IOMUXC select input index */
    kIOMUXC_XBAR1_XBAR_IN_SELECT_INPUT_37 = 315U,  /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_CS_SELECT_INPUT = 344U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_DQS_SELECT_INPUT = 345U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_0 = 346U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_1 = 347U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_2 = 348U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_3 = 349U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_4 = 350U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_5 = 351U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_6 = 352U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_IO_SELECT_INPUT_7 = 353U, /**< IOMUXC select input index */
    kIOMUXC_XSPI_SLV_IPP_IND_SCK_SELECT_INPUT = 354U, /**< IOMUXC select input index */
} iomuxc_select_input_t;
#endif /* IOMUXC_SELECT_INPUT_T_ */


/*!
 * @}
 */ /* end of group Mapping_Information */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- IOMUXC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Peripheral_Access_Layer IOMUXC Peripheral Access Layer
 * @{
 */

/** IOMUXC - Size of Registers Arrays */
#define IOMUXC_SW_MUX_CTL_PAD_COUNT               146u
#define IOMUXC_SW_PAD_CTL_PAD_COUNT               146u
#define IOMUXC_SELECT_INPUT_COUNT                 355u

/** IOMUXC - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t SW_MUX_CTL_PAD[IOMUXC_SW_MUX_CTL_PAD_COUNT]; /**< SW_MUX_CTL_PAD_GPIO_EMC_B1_00 SW MUX Control Register..SW_MUX_CTL_PAD_GPIO_B2_13 SW MUX Control Register, array offset: 0x10, array step: 0x4 */
  __IO uint32_t SW_PAD_CTL_PAD[IOMUXC_SW_PAD_CTL_PAD_COUNT]; /**< SW_PAD_CTL_PAD_GPIO_EMC_B1_00 SW PAD Control Register..SW_PAD_CTL_PAD_GPIO_B2_13 SW PAD Control Register, array offset: 0x258, array step: 0x4 */
  __IO uint32_t SELECT_INPUT[IOMUXC_SELECT_INPUT_COUNT]; /**< CAN1_IPP_IND_CANRX_SELECT_INPUT DAISY Register..XSPI_SLV_IPP_IND_SCK_SELECT_INPUT DAISY Register, array offset: 0x4A0, array step: 0x4, valid indices: [0-143, 190-266, 269-282, 285-315, 344-354] */
} IOMUXC_Type;

/* ----------------------------------------------------------------------------
   -- IOMUXC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup IOMUXC_Register_Masks IOMUXC Register Masks
 * @{
 */

/*! @name SW_MUX_CTL_PAD - SW_MUX_CTL_PAD_GPIO_EMC_B1_00 SW MUX Control Register..SW_MUX_CTL_PAD_GPIO_B2_13 SW MUX Control Register */
/*! @{ */

#define IOMUXC_SW_MUX_CTL_PAD_MUX_MODE_MASK      (0xFU)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */
#define IOMUXC_SW_MUX_CTL_PAD_MUX_MODE_SHIFT     (0U)
/*! MUX_MODE - MUX Mode Select Field.
 *  0b0000..Select mux mode: ALT0 mux port: MIC_BITSTREAM00 of instance: mic
 *  0b0001..Select mux mode: ALT1 mux port: SINC2_EMCLK03 of instance: sinc2
 *  0b0010..Select mux mode: ALT2 mux port: CAN3_TX of instance: can3
 *  0b0011..Select mux mode: ALT3 mux port: LPUART8_CTS_B of instance: lpuart8
 *  0b0100..Select mux mode: ALT4 mux port: LPUART6_TX of instance: lpuart6
 *  0b0101..Select mux mode: ALT5 mux port: GPIO6_IO24 of instance: gpio6
 *  0b0110..Select mux mode: ALT6 mux port: LPI2C4_SCL of instance: lpi2c4
 *  0b0111..Select mux mode: ALT7 mux port: FLEXSPI1_BUS2BIT_A_DATA00 of instance: flexspi1_bus2bit
 *  0b1000..Select mux mode: ALT8 mux port: TPM4_CH00 of instance: tpm4
 *  0b1001..Select mux mode: ALT9 mux port: LPSPI4_SCK of instance: lpspi4
 *  0b1010..Select mux mode: ALT10 mux port: XSPI_SLV_DATA00 of instance: xspi_slv
 *  0b1011..Select mux mode: ALT11 mux port: NETC_PINMUX_ETH2_RXD00 of instance: netc_pinmux
 *  0b1100..Select mux mode: ALT12 mux port: ECAT_RX_DATA0_1 of instance: ecat
 */
#define IOMUXC_SW_MUX_CTL_PAD_MUX_MODE(x)        (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_MUX_MODE_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_MUX_MODE_MASK)  /* Merged from fields with different position or width, of widths (3, 4), largest definition used */

#define IOMUXC_SW_MUX_CTL_PAD_SION_MASK          (0x10U)
#define IOMUXC_SW_MUX_CTL_PAD_SION_SHIFT         (4U)
/*! SION - Software Input On Field.
 *  0b0..Input Path is determined by functionality
 *  0b1..Force input path of pad GPIO_SD_B2_12_DUMMY
 */
#define IOMUXC_SW_MUX_CTL_PAD_SION(x)            (((uint32_t)(((uint32_t)(x)) << IOMUXC_SW_MUX_CTL_PAD_SION_SHIFT)) & IOMUXC_SW_MUX_CTL_PAD_SION_MASK)
/*! @} */

/*! @name SW_PAD_CTL_PAD - SW_PAD_CTL_PAD_GPIO_EMC_B1_00 SW PAD Control Register..SW_PAD_CTL_PAD_GPIO_B2_13 SW PAD Control Register */
/*! @{ */

